w6d2/first-routes/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "elephant"], ["email", "elephant.com"], ["created_at", "2020-12-30 00:38:15.958182"], ["updated_at", "2020-12-30 00:38:15.958182"]]
---
    def create
        user = User.new(params.require(:user).permit(:email,:name))
        if user.save

UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "elephant"], ["email", "elephant.com"], ["updated_at", "2020-12-30 00:31:05.399902"], ["id", 3]]
---
    def update
        # debugger
        User.update(params[:id]=> params.require(:user).permit(:email,:name))

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]
---
    def destroy
        user = User.find(params[:id])
        User.destroy(params[:id])