W6D3/first-routes/app/controllers/artworks_controller.rb

    def update
        artwork = Artwork.find(params[:id])
        if artwork.update_attributes(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "artworks" SET "image_url" = $1 WHERE "artworks"."id" = $2  [["image_url", "puppy.com"], ["id", 3]]