W6D3/first-routes/app/controllers/users_controller.rb

    def index
        user = User.find(params[:id])
         render json: User.all
---
SELECT "users".* FROM "users"

    def update
        user = User.find(params[:id])
        if user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "kitty"], ["updated_at", "2020-12-31 00:29:11.778119"], ["id", 3]]